#tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "rcmdnk/file"
brew "openssl@3"
brew "python@3.13"
brew "ansible"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "buf"
brew "ruby"
brew "cocoapods"
brew "ctags"
brew "curl"
brew "direnv"
brew "findutils"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghq"
brew "gist"
brew "git"
brew "go"
brew "go@1.24", link: false
brew "go@1.25", link: false
brew "gopls"
brew "goreleaser"
brew "graphicsmagick"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jid"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lv"
brew "mas"
brew "mercurial"
brew "protobuf"
brew "mysql"
brew "ngrep"
brew "nkf"
brew "node"
brew "nvm"
brew "openjdk"
brew "peco"
brew "pinact"
brew "playwright-cli"
brew "postgresql@15"
brew "proctools"
brew "pstree"
brew "pv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "ruby@3.3"
brew "tig"
brew "tmux"
brew "tmuxinator-completion"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"
cask "1password-cli"
cask "appcleaner"
cask "bettertouchtool"
cask "charles"
cask "claude"
cask "claude-code"
cask "cursor"
cask "deepl"
cask "dropbox"
cask "gcloud-cli"
cask "handbrake-app"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "macwhisper"
cask "ngrok"
cask "raycast"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "youtube-to-mp3"
cask "ytmdesktop-youtube-music"
vscode "golang.go"
vscode "marclipovsky.string-manipulation"
vscode "saoudrizwan.claude-dev"
